public_html/articles/cl/remoteswank.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Как подключать emacs к удаленному лисп-процессу.</title>
<!-- 2017-10-17 Вт 16:39 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rigidus" />
</head>
<body>
<div id="content">
<h1 class="title">Как подключать emacs к удаленному лисп-процессу.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Шаг за шагом</a></li>
<li><a href="#sec-2">2. Что может быть полезным</a></li>
</ul>
</div>
</div>
<p>
Сначала цитата - вдруг кто-то не знает об этом замечательном инциденте.
</p>

<p>
&lt;blockquote&gt;&lt;i&gt;
 И даже более впечатляющий пример удаленной отладки произошел в миссии NASA «Deep Space 1» в
 1998 году. Через полгода после запуска космического корабля, небольшой код на Lisp должен был
 управлять космическим кораблем в течении двух дней для проведения серии экспериментов. Однако,
 неуловимое состояние гонки (race condition) в коде не было выявлено при тестировании на земле и
 было обнаружено уже в космосе. Когда ошибка была выявлена в космосе (100 миллионов миль от
 Земли) команда смогла произвести диагностику и исправление работающего кода, что позволило
 завершить эксперимент. Один из программистов сказал об этом следующее:
</p>


<p>
 — Отладка программы, работающей на оборудовании стоимостью 100 миллионов долларов, которая
 находится в 100 миллионах миль от вас, является интересным опытом. REPL, работающий на
 космическом корабле, предоставляет бесценные возможности в нахождении и устранении проблем.
&lt;/i&gt;&lt;/blockquote&gt;
</p>

<p>
Лично я, смелый и храбрый программист могу только позавидовать такому экстремальному
времяпрепровождению. И естественно, сразу как только я это прочел - мне захотелось попробовать
так же :) Оказалось это довольно легко и может считаться штатной возможностью, которую следует
юзать и в хвост и в гриву на боевых серваках (если конечно вы достаточно оптимистичны,
самоуверенны и безрассудны :)
</p>

<p>
Я и не знал, что многие этого не знают, а те кто знают - забывают рассказать. Это как секс -
после того как первый раз сделаешь это - начинаешь делать все на автомате, не задумываясь :)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Шаг за шагом</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Заходим на сервак по ssh:
</li>
</ol>

<p>
&lt;code&gt;ssh user@host.ru&lt;/code&gt;
</p>

<p>
Спрашивают пароль, вводить нужно правильный, иначе странным образом ничего не получается.
</p>

<ol class="org-ol">
<li>Запускаем screen. По какой-то магической причине, если пропустить этот шаг, то после того
как терминальная сессия закроется вся магия исчезнет.
</li>

<li>Внутри screen запускаем sbcl. Тут сразу дают REPL, но весь дзен будет дальше, поэтому&#x2026;
</li>

<li>Вводим в REPL следующий код (можно скопировать прямо отсюда, вреда не будет, я гарантирую это!)
</li>
</ol>

<p>
&lt;source code="lisp"&gt;
(require 'asdf)
(asdf:oos 'asdf:load-op 'swank)
(setq swank:*use-dedicated-output-stream* nil)
(swank:create-server :coding-system "utf-8-unix" :dont-close t :port 4005)
&lt;/source&gt;
</p>

<p>
Этот код запустить swank внутри sbcl и он (swank) начнет слушать 4005 порт, но будет делать это
на удаленной машине - ну а мы там и находимся пока внутри терминальной сессии.
</p>

<ol class="org-ol">
<li>Нажимаем &lt;code&gt;Ctrl+a d&lt;/code&gt; - чтобы выйти из screen без его закрытия, оставив под
screen`ом работающий sbcl с запущенным в нем swank`ом. Больше нам нечего делать в
терминальной сессии, поэтому можно нажать &lt;code&gt;Ctrl+d&lt;/code&gt; чтобы из нее выйти. Теперь мы
снова у себя на машине.
</li>

<li>Открываем ssh-тоннель на удаленную машину:
</li>
</ol>

<p>
&lt;code&gt;ssh -2 -N -f -L 4005:localhost:4005 user@host.ru&lt;/code&gt;
</p>

<p>
Теперь все обращения к нашему 4005 порту будут уходить на удаленную машину и обращаться там по
4005 порту - а нам это и надо
</p>

<ol class="org-ol">
<li>Заходим в emacs и набираем &lt;code&gt;M-x slime-connect&lt;/code&gt; - и емакс послушно коннектится на локальный
4005 порт, который форвардится на удаленный 4005 порт, где его принимает swank, после чего
вы можете наслаждаться мощью лиспа ни в чем себе не отказывая.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Что может быть полезным</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>swank сам по себе - это библиотка лиспа. Она может быть неустановлена. Установиить можно
например с помощью asdf-install:
</li>
</ol>

<p>
&lt;source code="lisp"&gt;
(require 'asdf-install)
(asdf-install:install 'swank)
&lt;/source&gt;
</p>

<p>
Но лучше бы вам знать, как устанавливать библиотки в лиспе вручную. Все просто - нужно слить
библиотеку, положить ее в нужную папку (у меня это <i>usr/lib/sbcl/site</i>) и сделать симлинк на
asd-файл в папке систем (у меня это <i>usr/lib/sbcl/site-systems</i>). Нужные папки легко найти по
команде locate site-systems - там оно все рядом. Альтернативный вариант поиска, если вы знаете
какую-нибудь из установленных библиотек, например, alexandria - это выполнить в REPL такой код:
</p>

<p>
&lt;code&gt;(asdf:component-pathname (asdf:find-system '#:alexandria))&lt;/code&gt;
</p>

<ol class="org-ol">
<li>версия swank (снапшот) должна быть идентична и на клиенте и на сервере. Если об этом забыть
можно словить прикольные глюки :)
</li>

<li>Если, когда вы отошли хакнуть что-нибудь другое или просто попить кофе, ssh-тоннель умирает
от безделья и вам приходится с матом поднимать его снова, то пропишите в /etc/ssh/ssh<sub>config</sub>
директиву &lt;code&gt;ServerAliveInterval 5&lt;/code&gt;
</li>

<li>Некоторые лисперы забывают сконфигурировать emacs :) В вашем инициализационном файле емакса
должно быть что-то похожее на это:
</li>
</ol>

<p>
&lt;source code="elisp"&gt;
;; Lisp (SLIME) interaction
(setq inferior-lisp-program "sbcl"
lisp-indent-function 'common-lisp-indent-function
slime-complete-symbol-function 'slime-fuzzy-complete-symbol
; common-lisp-hyperspec-root "<a href="file:///Users/lisp/HyperSpec">file:///Users/lisp/HyperSpec</a>"
slime-startup-animation nil)
;; SLIME
(add-to-list 'load-path "~/.emacs.d/slime")
(require 'slime)
;(set-language-environment "utf-8")
(setq slime-net-coding-system 'utf-8-unix)
(slime-setup '(slime-fancy))
&lt;/source&gt;
</p>

<p>
Happy hacking!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2017-10-17 Вт 16:39</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode )</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
